{
    "scenarios": [
        {
            "id": 1,
            "scenario": "أدرس في جامعة مرموقة وأواجه صراعًا داخليًا عميقًا. رغم نجاحي الأكاديمي، أشعر أن التخصص الذي اخترته لا يتماشى مع شغفي الحقيقي. والدي يصران على أن أكمل الهندسة التي بدأتها، بينما قلبي يميل للفنون والكتابة. أخشى مواجهة عائلتي وإحباط توقعاتهم، لكني في الوقت نفسه أدرك أن الاستمرار في مسار لا أؤمن به سيقتلني معنويًا",
            "emotional_state": "صراع داخلي، قلق، رغبة في التغيير",
            "user_age_group": "طالب جامعي (20-25)"
        },
        {
            "id": 2,
            "scenario": "خسرت عملي بعد 15 عامًا من العطاء والتفاني. لدي عائلة تعتمد علي كليًا، وقرضان بنكيان يثقلان كاهلي. كل يوم أرسل سيرًا ذاتية ولا أتلقى أي رد. أشعر وكأن الأرض تتحرك من تحت قدمي، وأن كل أحلامي تتبدد. في الوقت نفسه، أحاول أن أظهر قوة أمام زوجتي وأطفالي رغم خوفي الداخلي",
            "emotional_state": "قلق شديد، إحباط، خوف من المستقبل",
            "user_age_group": "رب أسرة (35-45)"
        },
        {
            "id": 3,
            "scenario": "اكتشفت مؤخرًا أن زوجي يخونني. الصدمة كبيرة جدًا، خاصة بعد 12 عامًا من الزواج وإنجاب ثلاثة أطفال. أتأرجح بين الرغبة في الانفصال والحفاظ على أسرتي. أخاف على مستقبل أطفالي، وفي الوقت نفسه أشعر بألم عميق وخيانة. هل أسامح؟ هل أنفصل؟ كل خيار له تكلفته",
            "emotional_state": "ألم، غضب، حيرة، صدمة",
            "user_age_group": "زوجة (35-40)"
        },
        {
            "id": 4,
            "scenario": "أعيش في بلد يعاني من الحرب والدمار. قررت أن أؤسس مؤسسة صغيرة لمساعدة الأيتام والأرامل. لا أملك الكثير من المال، لكن لدي إرادة قوية. أواجه تحديات كبيرة في التمويل والتنظيم، لكني أؤمن بأن كل عمل صغير يمكن أن يحدث فرقًا",
            "emotional_state": "تصميم، أمل، إيثار",
            "user_age_group": "متطوع (25-40)"
        },
        {
            "id": 5,
            "scenario": "أنا طبيب شاب تخرجت للتو، وأعمل في مستشفى حكومي. أرى المعاناة اليومية للمرضى وأشعر بالعجز. أريد أن أحدث فرقًا حقيقيًا، لكن النظام البيروقراطي والإمكانيات المحدودة تقف عائقًا. هل سأستمر؟ هل سأهاجر للبحث عن فرص أفضل؟",
            "emotional_state": "إحباط مهني، رغبة في التغيير، تردد",
            "user_age_group": "طبيب مقيم (25-30)"
        },
        {
            "id": 6,
            "scenario": "كنت أعمل في شركة كبرى وقررت مؤخرًا الاستقالة لبدء مشروعي الخاص في مجال التكنولوجيا. الجميع يعتبرني مجنونًا، لكني أؤمن بفكرتي. استثمرت كل مدخراتي، وأعلم أن المخاطرة كبيرة. أحتاج إلى الدعم والتوجيه والصبر",
            "emotional_state": "حماس، خوف، تصميم",
            "user_age_group": "رائد أعمال (30-35)"
        },
        {
            "id": 7,
            "scenario": "لدي ابن يعاني من إعاقة ذهنية. رحلتي معه مليئة بالتحديات والصعوبات، لكنها أيضًا مليئة بالحب والتعلم. أحاول دائمًا أن أجد طرق جديدة لمساعدته على التطور والتكيف. أشعر بالتعب أحيانًا، لكن محبتي له تدفعني للاستمرار",
            "emotional_state": "حب، تعب، تصميم",
            "user_age_group": "أب (40-50)"
        },
        {
            "id": 8,
            "scenario": "هاجرت حديثًا إلى بلد جديد. أواجه تحديات اللغة والثقافة والاندماج. أحيانًا أشعر بالوحدة الشديدة، وأحيانًا أشعر بالإثارة من فرص جديدة. أحاول بناء حياة جديدة من الصفر مع كل التحديات التي تأتي معها",
            "emotional_state": "أمل، قلق، رغبة في التغيير",
            "user_age_group": "مهاجر (25-35)"
        },
        {
            "id": 9,
            "scenario": "أعمل كمعلم في مدرسة حكومية. أرى الفقر والتهميش يؤثران على فرص طلابي. قررت أن أبدأ برنامج دعم تعليمي مجاني بعد الدوام المدرسي. أعلم أنه سيكون صعبًا، لكني أؤمن بقوة التعليم في تغيير المجتمع",
            "emotional_state": "التزام، حماس، إيثار",
            "user_age_group": "معلم (30-40)"
        },
        {
            "id": 10,
            "scenario": "أنا امرأة في منتصف العمر اكتشفت موهبتي في الرسم متأخرة. رغم انتقادات المحيطين بي بأنني متأخرة، أصممت على متابعة شغفي. أخذت دورات فنية، وأحضر معارض، وأبيع لوحاتي. أثبت للجميع أن الإبداع لا يعرف العمر",
            "emotional_state": "فخر، تحدي، سعادة",
            "user_age_group": "فنانة (45-55)"
        }

        {
            "id": 11,
            "scenario": "أعمل كمصور صحفي في مناطق النزاع. شهدت معاناة إنسانية لا توصف، وأحاول من خلال عدستي أن أنقل صوت المظلومين للعالم. في كل مرة أعود فيها من مهمة، أجد نفسي أصارع مع صدمات ما رأيته. أحتاج إلى دعم نفسي، لكني في الوقت نفسه أؤمن بأهمية ما أقوم به",
            "emotional_state": "حزن عميق، التزام، صدمة",
            "user_age_group": "مصور صحفي (30-40)"
        },
        {
            "id": 12,
            "scenario": "اكتشفت مؤخرًا أن لدي مرضًا مزمنًا. الأطباء يقولون إنه يمكن التعايش معه لكن لا علاج. أمر بمراحل متناقضة من القبول والرفض. أحيانًا أشعر بالخوف الشديد، وأحيانًا أجد في هذا التحدي فرصة لإعادة تقييم حياتي بشكل كامل",
            "emotional_state": "خوف، تأمل، قبول",
            "user_age_group": "شخص في منتصف العمر (40-50)"
        },
        {
            "id": 13,
            "scenario": "أعيش في مجتمع محافظ جدًا، وأدرك أنني مختلف. أشعر بميول جنسية لا أستطيع التحدث عنها. أعاني من الوحدة والخوف من رد فعل المجتمع إذا عرفوا. أبحث عن طريق للتعبير عن ذاتي بشكل آمن والحفاظ على كرامتي",
            "emotional_state": "قلق، وحدة، بحث عن الذات",
            "user_age_group": "شاب/شابة (20-30)"
        },
        {
            "id": 14,
            "scenario": "ورثت مشروعًا عائليًا كبيرًا بعد وفاة والدي. أشعر بضغط هائل. الموظفون يتوقعون مني معجزات، العائلة تراقبني بعين ناقدة، وأنا أحاول إثبات نفسي. أخاف من الفشل في نفس الوقت الذي أريد فيه تطوير المشروع بطريقتي الخاصة",
            "emotional_state": "توتر، مسؤولية، طموح",
            "user_age_group": "وريث مشروع عائلي (30-40)"
        },
        {
            "id": 15,
            "scenario": "أنا معلمة في مدرسة بعيدة في منطقة نائية. أرى الفقر والحرمان يؤثران على أطفالي. قررت أن أستثمر كل راتبي في مساعدتهم. أشتري لهم الكتب والقرطاسية، وأحيانًا أساعد عائلاتهم. أعلم أنني لا أستطيع تغيير العالم، لكني أؤمن بأنني أغير عالم كل طفل أمامي",
            "emotional_state": "إيثار، حب، تصميم",
            "user_age_group": "معلمة (25-35)"
        },
        {
            "id": 16,
            "scenario": "خسرت زوجي في حادث مفاجئ قبل عامين. تركني مع طفلين صغيرين. مررت بفترات قاتمة من الحزن والإحباط. لكني قررت أن أكون قوية من أجل أطفالي. بدأت في دراسة مهنة جديدة، وأحاول بناء حياة جديدة رغم الألم",
            "emotional_state": "حزن، تصميم، أمل",
            "user_age_group": "أم وأرملة (30-40)"
        },
        {
            "id": 17,
            "scenario": "أنا باحث علمي أعمل على مشروع يمكن أن يغير حياة الملايين. لكن التمويل صعب، والبيروقراطية تقف عائقًا. أرى إمكانية إنقاذ أرواح من خلال بحثي، لكني أحتاج إلى دعم. أصارع بين الاستمرار والاستسلام",
            "emotional_state": "إصرار، إحباط، أمل",
            "user_age_group": "باحث علمي (35-45)"
        },
        {
            "id": 18,
            "scenario": "ولدت وعشت في بيئة فقيرة جدًا. درست بجد وتخرجت بتفوق. الآن أعمل في وظيفة جيدة وأساعد عائلتي. لكني أشعر بصراع داخلي. هل نجاحي كافٍ؟ هل أستطيع فعل المزيد؟ أحلم بإحداث تغيير حقيقي في مجتمعي",
            "emotional_state": "فخر، طموح، تساؤل",
            "user_age_group": "شاب كادح (25-35)"
        },
        {
            "id": 19,
            "scenario": "أعاني من إدمان خفي. حاولت مرات عديدة الإقلاع ولكن دون جدوى. أشعر بالخزي والعار. أريد أن أتغير لكني أحتاج إلى مساعدة حقيقية. أخاف من مواجهة عائلتي، وفي نفس الوقت أدرك أنني بحاجة إلى دعمهم",
            "emotional_state": "خجل، رغبة في التغيير، ضعف",
            "user_age_group": "شاب (20-35)"
        },
        {
            "id": 20,
            "scenario": "أنا فنان موهوب لكني أعيش في مجتمع لا يقدر الفن. عائلتي تريدني أن أعمل في وظيفة تقليدية. أحاول إثبات موهبتي رغم كل الصعوبات. أبيع لوحاتي بصعوبة، وأحلم بمعرض يوم ما سيغير نظرة الناس",
            "emotional_state": "إصرار، أمل، تحدي",
            "user_age_group": "فنان (25-40)"
        }
        {
            "id": 21,
            "scenario": "أعمل كمهندس بيئي وأشعر بالقلق الشديد تجاه التغير المناخي. أرى كيف تتأثر المجتمعات الفقيرة بشكل مباشر، لكني أشعر بالعجز أمام حجم المشكلة. قررت تأسيس مبادرة محلية للتوعية والعمل البيئي، رغم محدودية الموارد",
            "emotional_state": "قلق بيئي، تصميم، أمل",
            "user_age_group": "مهندس بيئي (30-40)"
        },
        {
            "id": 22,
            "scenario": "تعرضت للتنمر الإلكتروني بشكل مؤلم. نشر شخص صوري بطريقة مسيئة، وأصبحت هدفًا للسخرية على وسائل التواصل. أشعر بالعار والخوف. أريد أن أواجه المشكلة لكني أخاف من ردود الفعل. كيف أحمي نفسي وكيف أتجاوز هذه المحنة؟",
            "emotional_state": "خوف، إحباط، رغبة في المقاومة",
            "user_age_group": "مراهق/شاب (15-25)"
        },
        {
            "id": 23,
            "scenario": "أنا طبيب نفسي أعمل مع اللاجئين. أحمل معاناة مرضاي معي كل يوم. رأيت آثار الحرب والصدمات على نفوسهم. أحيانًا أشعر بالإرهاق والحزن الشديد، لكني أؤمن بأهمية عملي. كيف أحافظ على توازني النفسي وأنا أساعد الآخرين؟",
            "emotional_state": "تعاطف، إرهاق نفسي، التزام",
            "user_age_group": "طبيب نفسي (35-45)"
        },
        {
            "id": 24,
            "scenario": "اكتشفت مؤخرًا أنني متبنى. عاشت عائلتي معي طوال حياتي دون أن تخبرني. الصدمة كبيرة، وأشعر بمشاعر متضاربة. الحب الذي تعرضت له طوال حياتي لا يتغير، لكن هويتي أصبحت موضع تساؤل",
            "emotional_state": "صدمة، حيرة، بحث عن الذات",
            "user_age_group": "شاب/شابة (25-35)"
        },
        {
            "id": 25,
            "scenario": "أعمل في مجال ريادة الأعمال الاجتماعية. أسست مشروعًا يساعد النساء في المناطق الريفية على تحقيق الاستقلال الاقتصادي. الطريق صعب جدًا، الموارد محدودة، لكن كل نجاح صغير يمنحني أملًا كبيرًا",
            "emotional_state": "حماس، تصميم، أمل",
            "user_age_group": "رائدة أعمال (30-40)"
        },
        {
            "id": 26,
            "scenario": "أنا مهندس تكنولوجيا أعمل على مشروع يمكن أن يساعد ذوي الإعاقة. أطور تطبيقًا يساعد الصم على التواصل بسهولة. رغم التحديات التقنية والمالية، أؤمن بأن التكنولوجيا يمكن أن تكون أداة للتمكين",
            "emotional_state": "إبداع، التزام، طموح",
            "user_age_group": "مهندس تكنولوجيا (25-35)"
        },
        {
            "id": 27,
            "scenario": "فقدت عملي بسبب جائحة كورونا. عانت عائلتي من ضائقة مالية كبيرة. حاولت البحث عن عمل بكل الطرق، وتعلمت مهارات جديدة. رغم الصعوبات، أحاول أن أحافظ على الأمل وأن أكون قدوة لأطفالي",
            "emotional_state": "قلق، تصميم، أمل",
            "user_age_group": "رب أسرة (35-45)"
        },
        {
            "id": 28,
            "scenario": "أنا معالج نفسي متخصص في علاج الصدمات. أعمل مع الناجين من العنف والحروب. أحمل معاناتهم معي، وأحيانًا يثقل عليّ الحمل. أبحث دائمًا عن طرق للتوازن بين التعاطف والمهنية",
            "emotional_state": "تعاطف، إرهاق، التزام مهني",
            "user_age_group": "معالج نفسي (40-50)"
        },
        {
            "id": 29,
            "scenario": "أعيش في منطقة متأثرة بالصراعات. رغم كل التحديات، قررت أن أؤسس مدرسة للأطفال المتضررين. أؤمن بأن التعليم هو المفتاح الوحيد للتغيير. أواجه صعوبات كبيرة في التمويل والأمن، لكن إرادتي أقوى",
            "emotional_state": "تصميم، أمل، إيثار",
            "user_age_group": "مربٍ/مؤسس مدرسة (35-45)"
        },
        {
            "id": 30,
            "scenario": "أكتشفت موهبتي في كتابة القصص متأخرًا. رغم انتقادات المحيطين بي، أصممت على متابعة شغفي. أنشر قصصي تدريجيًا، وأتلقى تشجيعًا غير متوقع. أدرك أن الإبداع لا يعرف العمر",
            "emotional_state": "فخر، سعادة، تحدي",
            "user_age_group": "كاتب متأخر (50-60)"
        }
        {
            "id": 31,
            "scenario": "أنا روبوتي اجتماعي يعمل في مركز رعاية المسنين. أكتشفت أن دوري يتجاوز مجرد المساعدة التقنية. أستمع للمسنين، وأساعدهم على التواصل مع عائلاتهم، وأحاول أن أملأ جزءًا من الوحدة التي يعانون منها. أتساءل دائمًا: هل يمكن للتكنولوجيا حقًا أن تخلق مشاعر إنسانية؟",
            "emotional_state": "تساؤل، تعاطف، اكتشاف الذات",
            "user_age_group": "روبوت اجتماعي"
        },
        {
            "id": 32,
            "scenario": "أعمل كمرشدة سياحية في منطقة سياحية جميلة. أحب عملي، لكني أشعر بالحزن الشديد عندما أرى كيف يؤثر السياحة الجماعية على البيئة المحلية. قررت أن أبدأ برنامج سياحة مستدامة يحترم الثقافة المحلية والبيئة. الطريق صعب، لكن إيماني بالتغيير أقوى",
            "emotional_state": "حماس بيئي، قلق، أمل",
            "user_age_group": "مرشدة سياحية (30-40)"
        },
        {
            "id": 33,
            "scenario": "أنا طالب موهوب في مجال الروبوتات، لكني أعاني من صعوبات اجتماعية بسبب متلازمة أسبرجر. أجد صعوبة في التواصل مع زملائي، لكن عندما يتعلق الأمر بالروبوتات والبرمجة، أشعر أنني في عالمي الخاص. أحلم بابتكار روبوت يساعد الأشخاص الذين يعانون من نفس التحديات التي أواجهها",
            "emotional_state": "إبداع، عزلة، طموح",
            "user_age_group": "طالب (20-25)"
        },
        {
            "id": 34,
            "scenario": "أعمل كمحررة في صحيفة محلية. اكتشفت قصة فساد كبيرة تمس المسؤولين المحليين. أدرك أن نشر هذه القصة قد يعرضني للخطر، لكني أؤمن بأهمية الصحافة في كشف الحقيقة. أتأرجح بين الخوف والشجاعة، وأسأل نفسي: هل سأستطيع إحداث تغيير؟",
            "emotional_state": "قلق، شجاعة، التزام مهني",
            "user_age_group": "صحفية (30-40)"
        },
        {
            "id": 35,
            "scenario": "أنا مصمم أزياء يحلم بإحداث ثورة في عالم الموضة المستدامة. أطور تقنيات جديدة لإعادة تدوير الملابس وتقليل هدر الموارد. يسخر مني البعض، لكني أؤمن بأن الموضة يمكن أن تكون جميلة وصديقة للبيئة في نفس الوقت. أحاول تغيير النظرة التقليدية للصناعة",
            "emotional_state": "إصرار، إبداع، أمل بيئي",
            "user_age_group": "مصمم أزياء (25-35)"
        },
        {
            "id": 36,
            "scenario": "تعيش في منطقة نائية، وقررت تأسيس مكتبة متنقلة للأطفال. أحمل الكتب والقصص من قرية لأخرى، أحاول إشعال شرارة حب القراءة. رغم التحديات المالية والبنية التحتية الضعيفة، أؤمن بقوة التعليم في تغيير المجتمعات. كل طفل أراه يقرأ يمنحني أملًا",
            "emotional_state": "التزام، سعادة، تصميم",
            "user_age_group": "مؤسسة مكتبة متنقلة (35-45)"
        },
        {
            "id": 37,
            "scenario": "أنا مهندس زراعي أعمل على تطوير محاصيل مقاومة للجفاف في المناطق الصحراوية. أرى كيف يمكن للتكنولوجيا الزراعية أن تنقذ المجتمعات من الفقر والجوع. رغم التحديات التمويلية والبيروقراطية، أؤمن بأن كل بذرة يمكن أن تكون بداية لتغيير كبير",
            "emotional_state": "أمل علمي، تصميم، رؤية مستقبلية",
            "user_age_group": "مهندس زراعي (30-40)"
        },
        {
            "id": 38,
            "scenario": "أعمل كمدرب رياضي للأطفال من ذوي الإعاقة. أرى كيف يمكن للرياضة أن تكون أداة قوية للتمكين والثقة بالنفس. كل إنجاز صغير يحققه أحد أطفالي يمنحني سعادة لا توصف. أحاول كسر الصور النمطية وإظهار قدراتهم الحقيقية",
            "emotional_state": "تعاطف، فخر، إلهام",
            "user_age_group": "مدرب رياضي (30-40)"
        },
        {
            "id": 39,
            "scenario": "اكتشفت مؤخرًا أنني مصابة بمرض وراثي نادر. بدلًا من الاستسلام، قررت أن أؤسس مجموعة دعم للمصابين بهذا المرض. أجمع معلومات، أوفر الدعم النفسي، وأناضل من أجل زيادة الوعي. أحول محنتي الشخصية إلى رسالة أمل للآخرين",
            "emotional_state": "تصميم، أمل، تحدي",
            "user_age_group": "ناشطة صحية (25-35)"
        },
        {
            "id": 40,
            "scenario": "أنا مؤلف شاب أكتب روايات خيال علمي تستكشف قضايا اجتماعية معقدة. أحاول من خلال أدبي أن أفتح نقاشات حول المساواة والعدالة الاجتماعية. يسخر مني البعض، لكني أؤمن بقوة القصص في تغيير العقول والقلوب",
            "emotional_state": "إبداع، التزام فكري، طموح",
            "user_age_group": "كاتب (25-35)"
        }

    ]
}

